// function : declaration expression

// declaration

// function task() {
//     return "Hello"
// }
// console.log(task());

// expression

// const task = () => {
//   return "Hello";
// };
// console.log(task());

// есть 2 свойствы
// 1 это параметр
// 2 это аргумент

// ternary operator
// ? - if
// : - else

// console.log(5 === 5 ? "barabar" : "baraber emes");
// console.log(5 === 5 if "barabar" else "baraber emes");


// 1. Проверка, пустая ли строка
// Задача: Напишите функцию, которая принимает строку и возвращает "Пустая строка", если она пустая, иначе возвращает саму строку.



// 2. Выбор приветствия в зависимости от времени суток
// Задача: Напишите функцию, которая принимает часы (от 0 до 23) и возвращает приветствие: "Доброе утро", "Добрый день" или "Добрый вечер".



// 3. Определение высокого или низкого роста
// Задача: Напишите функцию, которая принимает рост (в см) и возвращает "Высокий", если рост больше 170 см, или "Низкий", если меньше или равен 170 см.
