// function : declaration and expression

// declaration
// function task() {
//   return "Hello";
// }
// console.log(task());

// expression
// const task = () => {
//   return "Hello";
// };
// console.log(task());

// function есть 2 свойствы [параметр] и [аргумент]
// function task(параметр) {
//   return;
// }
// console.log(task(аргумент));

// 1. Проверка числа на четность
// Задача: Напишите функцию, которая принимает число и возвращает, является ли оно четным, используя тернарный оператор.

// function task1(a, b) {
//   return a % b === 0 ? "чётный" : "не чётный";
// }
// console.log(task1(100, 2));

// 2. Сравнение двух чисел
// Задача: Напишите функцию, которая принимает два числа и возвращает большее из них с помощью тернарного оператора.

// 3. Проверка длины строки
// Задача: Напишите функцию, которая принимает строку и проверяет, длиннее ли она 5 символов, используя тернарный оператор.

// function task3(str) {
//   return str.length > 5 ? "yes" : "no";
// }
// console.log(task3("Joodarbeshim"));

// 4. Возвращение положительного числа
// Задача: Напишите функцию, которая принимает число и возвращает его, если оно положительное, иначе возвращает 0.

// function task4(num) {
//   return num >= 0 ? "положительное" : 0;
// }
// console.log(task4(0));

// 5. Проверка возраста на совершеннолетие
// Задача: Напишите функцию, которая принимает возраст и возвращает "Совершеннолетний" или "Несовершеннолетний" в зависимости от значения.

// function task5(age) {
//   return age > 0 && age < 18 ? "Несовершеннолетний" : "Совершеннолетний";
// }
// console.log(task5(19));

// 6. Определение, является ли число нулём
// Задача: Напишите функцию, которая принимает число и возвращает "Ноль", если это 0, или само число в противном случае.

// function task6(num) {
//   return num > 0 ? num : "Ноль";
// }
// console.log(task6(0));

// 7. Проверка на отрицательное число
// Задача: Напишите функцию, которая принимает число и возвращает сообщение, является ли число отрицательным, используя тернарный оператор.

// 8. Преобразование строки в заглавные буквы (если она больше 3 символов)
// Задача: Напишите функцию, которая принимает строку и преобразует её в заглавные буквы, если её длина больше 3 символов.

// 9. Проверка на кратность числа
// Задача: Напишите функцию, которая принимает два числа: число и делитель, и возвращает, делится ли число на делитель без остатка.
