// condition - условия

// = присвоение
// == ровно
// === строгий ровно
// > больше
// < меньше
// >= больше или ровно
// <= меньше или ровно

// -5 -4 -3 -2 -1 0 1 2 3 4 5

// console.log(5 == "5");
// console.log(5 === "5");

// true - 1, 1234, "abcdef", "    "
// false - 0, ""

// ! : набарот
// логическая сумма - || :+
// логическая умножения - && :*

// || - или
// && - и

// 1. Вам дана переменная a. Если переменная a равна 10, то выведите 'Верно', иначе
//  выведите 'Неверно'.

// let a = 11;
// if (a == 10) {
//   console.log("Верно");
// } else {
//   console.log("Неверно");
// }

// 2. Вам даны две переменные a=50, b=100. Составьте условие, по которому в консоль
//  будет выводиться 'a больше b', 'a меньше b'.

// let a = 150,
//   b = 100;
// if (a > b) {
//   console.log("a больше b");
// } else if (a < b) {
//   console.log("a меньше b");
// }

// 3. Вам дана переменная a=-2. Составьте условие, по которому в консоль будет выводиться
//  'positive' - если число больше 0, 'равно' если число равно 0, "negative" если число меньше 0.

// let a = 2;
// if (a ) {

// } else {

// }

// 4. Вам дана переменная number=45. Составьте условие, по которому будет выводиться
//  в консоль "Четное число", "Нечетное число".

// let num = 45;
// if (num % 2) {
//   console.log("Четное число");
// } else {
//   console.log("Нечетное число");
// }

// 5. Вам даны две переменные a=10, b=2. Составьте условие, по которому, остаток деления
//  a на b, будет выводиться консоль "Четное число", "Нечетное число".

// let a = 10,
//   b = 2;
// if (a % b) {
//   console.log("Четное число");
// } else {
//   console.log("Нечетное число");
// }

// 6. Вам дана переменная s. Составьте условие, по которому в консоль будет выводится
//  тип этой переменной - "boolean", "number", "string".

// 10. Вам даны переменные a , b. Если переменная a больше 4-х и меньше 10-ти,
// или переменная b больше или равна 7-ми и меньше 17-ти, то выведите 'Верно',
// в противном случае выведите 'Неверно'

// let a = 19,
//   b = 20;
// if ((a > 4 && a < 10) || (b > 7 && b < 17)) {
//   console.log("Верно");
// } else {
//   console.log("Неверно");
// }

// 11. Вам дана переменная month. В ней лежит какое-то число из интервала от
// 1 до 12. Определите в какую пору года попадает этот месяц (зима, лето,
// весна, осень).
// 12. Вам дана переменная day. В ней лежит какое-то число из интервала от 1
// до 31. Определите в какую декаду месяца попадает это число (в первую, вторую
// или третью).
// 13. Вам дана переменная a='12345'. Проверьте, что первым символом этой
// переменной является цифра 1, 2 или 3. Если это так – выведите ‘да’, в
// противном случае выведите ‘нет’.
