// <<<<JavaScript>>>>

// data type - типы данных : их 8
// number-только номер : приметивный
// string-только строка : приметивный
// boolean-true/false : приметивный
// undefined-не известно : приметивный
// null-пустой : приметивный
// symbol-символы : приметивный
// bigint-больщие цифры : приметивный
// object : ссылочный

// переменные : их 3
// var -
// let +
// const +

// Math

// console.log(Math.pow(3, 2)); : не сколько раз себя умножает
// console.log(Math.abs(-50)); : плюсует
// console.log(Math.sqrt(64)); : корень
// console.log(Math.trunc(33.44)); : после точки не работает цифры
// console.log(Math.random()); : дает рандомные число
// console.log(Math.floor(8.3)); : округляет назад
// console.log(Math.ceil(1.2)); : округляет вперёд
// console.log(Math.round(1.4)); : округляет как человек

// 2. Вам даны переменные a=10, b=2 и c=5. Выведите в консоль их сумму.

// let a = 10,
//   b = 2,
//   c = 5;
// console.log(a + b + c);

// 3. Вам дана переменная со значением 100, выведите в консоль умноженную переменную на 2.

// let num = 100;
// console.log(num * 2);

// 4. Вам дана переменная со значением 67. Выведите в консоль остаток деления на 7.

// let num = 67;
// console.log(num % 10);

// 5. Вам даны переменные a=10 и b=2. Выведите в консоль их сумму, разность,
//  произведение и частное (результат деления).

// let a = 10,
//   b = 2;
// console.log(a - b);

// 6. Вам даны переменные c=15 и d=2. Просуммируйте их, а результат присвойте переменной
//  result. Выведите в консоль значение переменной result.

// let c = 15,
//   d = 2;
// let result = c + d;
// console.log(result);

// 7. Вам даны переменные a=30, и b=15 Сложите переменные a и b и результат присвойте
//  переменной c. Затем выведите в консоль остаток деления на 4 переменной c.

// let a = 30;
// let b = 15;
// let c = a + b;
// console.log(c % 4);

// 8. Вам даны переменные a=17 и b=10. Отнимите от a переменную b и результат присвойте
// переменной c. Затем создайте переменную d, присвойте ей значение. Сложите переменные c и d, а
//  результат запишите в переменную result. Выведите в консоль значение переменной result.

// let a = 17;
// let b = 10;
// let c = a - b;
// let d = 5;
// let result = c + d;
// console.log(result);

let year = 2024;
console.log(Math.ceil(year / 100));

// console.log("Сумма:", a + b);         // Выводит сумму
// console.log("Разность:", a - b);      // Выводит разность
// console.log("Произведение:", a * b);  // Выводит произведение
// console.log("Частное:", a / b);       // Выводит частное
